In [1]:
import pandas as pd

# Series

In [12]:
students = {'John': 18,
            'Almir': 16,
            'Bita': 14.5,
            'Sarah': 19.25,
            'Noah': 19
            }

ds = pd.Series(students)

# Element Access in Series

In [13]:
print(students.keys())
print(students.values())

print(ds.index)
print(ds.values)

dict_keys(['John', 'Almir', 'Bita', 'Sarah', 'Noah'])
dict_values([18, 16, 14.5, 19.25, 19])
Index(['John', 'Almir', 'Bita', 'Sarah', 'Noah'], dtype='object')
[18.   16.   14.5  19.25 19.  ]

In [14]:
print(students["Noah"])
print(ds["Noah"])
print(ds.Noah)
print(ds[4])

19
19.0
19.0
19.0

C:\Users\elham\AppData\Local\Temp\ipykernel_14644\2877678958.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(ds[4])

# Multi Access in Series

In [17]:
# print(students["Almir", "Noah"])
# print(students[["Almir", "Noah"]])

print(ds[["Almir", "Noah"]])
print(ds[[1, 4]])
print(ds[1:5])
print(ds['Almir':'Noah'])

Almir    16.0
Noah     19.0
dtype: float64
Almir    16.0
Noah     19.0
dtype: float64
Almir    16.00
Bita     14.50
Sarah    19.25
Noah     19.00
dtype: float64
Almir    16.00
Bita     14.50
Sarah    19.25
Noah     19.00
dtype: float64

C:\Users\elham\AppData\Local\Temp\ipykernel_14644\2574132194.py:5: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(ds[[1, 4]])

# Arithmetic Operations

In [20]:
marks = list(students.values())
avg = sum(marks) / len(marks)

for i in students:
    if students[i] > avg:
        print(i)



print(ds.mean())
print(ds > ds.mean())
print(ds[ds > ds.mean()])

John
Sarah
Noah
17.35
John      True
Almir    False
Bita     False
Sarah     True
Noah      True
dtype: bool
John     18.00
Sarah    19.25
Noah     19.00
dtype: float64

# Dataframes

In [21]:
students = {"name": ["Mona", "Neil", "Ellie", "Sarah", "John", "Noah", "Ethan", "Lucy", "Justin", "Helen"],
            "grade": [12, 5, 18, 16.5, 7, 17, 19, 13, 6, 8],
            "Guest": [True, True, False, False, False, False, False, True, True, False],
            "city": ["Paris", "Rome", "Toronto", "Vancouver", "Edmonton", "Toronto", "Sudbery", "New York", "Calgary", "Tehran"],
            "age": [21, 26, 16, 21, 15, 18, 46, 34, 17, 20]}

df = pd.DataFrame(students)
df

     name  grade  Guest       city  age
0    Mona   12.0   True      Paris   21
1    Neil    5.0   True       Rome   26
2   Ellie   18.0  False    Toronto   16
3   Sarah   16.5  False  Vancouver   21
4    John    7.0  False   Edmonton   15
5    Noah   17.0  False    Toronto   18
6   Ethan   19.0  False    Sudbery   46
7    Lucy   13.0   True   New York   34
8  Justin    6.0   True    Calgary   17
9   Helen    8.0  False     Tehran   20

# Shape

In [24]:
n_rows, n_cols = df.shape
print(f"Number of Samples: {n_rows}\nNumber of features: {n_cols}")

Number of Samples: 10
Number of features: 5

# Access Rows and Columns

In [25]:
print(df.columns)
print(df.index)
print(df.values)

Index(['name', 'grade', 'Guest', 'city', 'age'], dtype='object')
RangeIndex(start=0, stop=10, step=1)
[['Mona' 12.0 True 'Paris' 21]
 ['Neil' 5.0 True 'Rome' 26]
 ['Ellie' 18.0 False 'Toronto' 16]
 ['Sarah' 16.5 False 'Vancouver' 21]
 ['John' 7.0 False 'Edmonton' 15]
 ['Noah' 17.0 False 'Toronto' 18]
 ['Ethan' 19.0 False 'Sudbery' 46]
 ['Lucy' 13.0 True 'New York' 34]
 ['Justin' 6.0 True 'Calgary' 17]
 ['Helen' 8.0 False 'Tehran' 20]]

# Informative Methods

In [27]:
df.head(2)

   name  grade  Guest   city  age
0  Mona   12.0   True  Paris   21
1  Neil    5.0   True   Rome   26

In [29]:
df.tail(2)

     name  grade  Guest     city  age
8  Justin    6.0   True  Calgary   17
9   Helen    8.0  False   Tehran   20

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10 non-null     object
 1   grade   10 non-null     float64
 2   Guest   10 non-null     bool
 3   city    10 non-null     object
 4   age     10 non-null     int64
dtypes: bool(1), float64(1), int64(1), object(2)
memory usage: 458.0+ bytes

In [31]:
df.describe(include=["float64"])

        grade
count  10.000
mean   12.150
std     5.344
min     5.000
25%     7.250
50%    12.500
75%    16.875
max    19.000

# Access Columns

In [33]:
df["grade"]
df.grade
df["grade"] > 13

0    False
1    False
2     True
3     True
4    False
5     True
6     True
7    False
8    False
9    False
Name: grade, dtype: bool

# Read CSV Files

In [45]:
df = pd.read_csv('iris.data')

In [49]:
df.head()

   5.1  3.5  1.4  0.2  Iris-setosa
0  4.9  3.0  1.4  0.2  Iris-setosa
1  4.7  3.2  1.3  0.2  Iris-setosa
2  4.6  3.1  1.5  0.2  Iris-setosa
3  5.0  3.6  1.4  0.2  Iris-setosa
4  5.4  3.9  1.7  0.4  Iris-setosa

In [47]:
df.describe()

              5.1         3.5         1.4         0.2
count  149.000000  149.000000  149.000000  149.000000
mean     5.848322    3.051007    3.774497    1.205369
std      0.828594    0.433499    1.759651    0.761292
min      4.300000    2.000000    1.000000    0.100000
25%      5.100000    2.800000    1.600000    0.300000
50%      5.800000    3.000000    4.400000    1.300000
75%      6.400000    3.300000    5.100000    1.800000
max      7.900000    4.400000    6.900000    2.500000

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 149 entries, 0 to 148
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   5.1          149 non-null    float64
 1   3.5          149 non-null    float64
 2   1.4          149 non-null    float64
 3   0.2          149 non-null    float64
 4   Iris-setosa  149 non-null    object
dtypes: float64(4), object(1)
memory usage: 5.9+ KB